src/load-generator/scenario.yml
config:
  target: "http://k8s-ui-ui-0cba5ad9e9-b5b757cb5d44a266.elb.us-east-2.amazonaws.com"
  phases:
    - duration: 600 # Run for 60 seconds
      arrivalRate: 1000 # Start with 50 requests per second
    - duration: 90 # Run for another 120 seconds
      arrivalRate: 1000 # Increase to 200 requests per second
    - duration: 120 # Run for another 180 seconds
      arrivalRate: 1000 # Increase to 500 requests per second
    - duration: 150 # Run for another 180 seconds
      arrivalRate: 1000 # Increase to 500 requests per second
    - duration: 180 # Run for another 180 seconds
      arrivalRate: 1000 # Increase to 500 requests per second
    - duration: 240 # Run for another 180 seconds
      arrivalRate: 1000 # Increase to 500 requests per second
  processor: "./helpers.js"

scenarios:
  - name: "Test"
    beforeScenario: getAllProducts
    flow:
      - get:
          url: "/home"
      - get:
          url: "/catalog"
      - loop:
          - get:
              url: "/catalog/{{ $loopElement }}"
        over: allProducts
      - post:
          url: "/cart"
          beforeRequest: setRandomProductId
          form:
            productId: "dummy"
      - get:
          url: "/cart"
      - get:
          url: "/checkout"
      - post:
          url: "/checkout"
          form:
            firstName: John
            lastName: Doe
            email: jdoe789@example.com
            address1: 123 Main Street
            address2:
            city: New York
            state: NY
            zip: 12345
      - post:
          url: "/checkout/delivery"
          form:
            token: priority-mail
      - post:
          url: "/checkout/confirm"